tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "vapor/tap"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Collection of portable C++ source libraries
brew "boost", link: false
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Add GitHub support to git on the command-line
brew "hub"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# SDL2 graphics drawing primitives and other support functions
brew "sdl2_gfx"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Small sample cross-platform networking library
brew "sdl2_net"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Plugin and runtime library for using protobuf with Swift
brew "swift-protobuf"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
cask "alfred"
cask "iterm2"
cask "slack"
mas "DevCleaner", id: 1388020431
mas "GIPHY CAPTURE", id: 668208984
mas "Magnet", id: 441258766
mas "Paste JSON as Code • quicktype", id: 1330801220
mas "Telegram", id: 747648890
mas "Twitter", id: 1482454543
mas "Vimari", id: 1480933944
